import random 
def magic_ball():
    answers = [
    'Бесспорно',
    'Предрешено',
    'Никаких сомнений',
    'Определённо да',
    'Можешь быть уверен в этом',
    'Мне кажется - да',
    'Вероятнее всего',
    'Хорошие перспективы',
    'Знаки говорят - да',
    'Да',
    'Пока неясно, попробуй снова',
    'Спроси позже',
    'Лучше не рассказывать',
    'Сейчас нельзя предсказать',
    'Сконцентрируйся и спроси опять',
    'Даже не думай',
    'Мой ответ - нет',
    'По моим данным - нет',
    'Перспективы не очень хорошие',
    'Весьма сомнительно'
    ]


    print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.', 'Как зовут тебя ?', sep= '\n')
    name = input()
    print(f'Меня зовут: {name}', f'Привет, {name} ^_^', 'Какой у тебя вопрос ?', sep= '\n')


    q1 = []
    while True:
        question = input()
        q1.append(random.choice(answers))
        print(q1)
        again = input('Хочешь задать ещё один вопрос? (да/нет):')
        if again == 'нет':
            break
            return []
        else:
            continue


print(magic_ball())
